// 1. 1 থেকে 50 পর্যন্ত সব সংখ্যা প্রিন্ট করো।
console.log(`🧩 ১ থেকে ৫০ পর্যন্ত সব সংখ্যা প্রিন্ট করা হলো:`);
let number = 1 ;
while(number <= 50){
    console.log( `✅ ${number}`);
    number++ ;
}

// 2. 1 থেকে 100 পর্যন্ত জোড় সংখ্যা (even numbers) প্রিন্ট করো।
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত সব জোড় সংখ্যা প্রিন্ট করা হলো:`);
 for(let i = 1 ; i <= 100 ; i++){
    if(i %  2 === 0 ){
        console.log(`✅ ${i}`);
    }
}
 
// 3. 1 থেকে 100 পর্যন্ত বিজোড় সংখ্যা (odd numbers) প্রিন্ট করো।
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত সব বিজোড় সংখ্যা প্রিন্ট করা হলো:`);
for(let i = 1 ; i <= 100 ; i++){
    if(i % 2 === 1){
        console.log(`✅ ${i}`);
    }
}

// 4. 1 থেকে 20 পর্যন্ত সংখ্যাগুলোর যোগফল (sum) বের করো।
console.log(`🧩 ১ থেকে ২০ পর্যন্ত সংখ্যাগুলোর যোগফল (sum) বের করা হলো:`);
let sum = 0 ;
let number0 = 1 ;
while(number0 <= 20){
    number0++;
    sum = sum + number0 ;
}console.log(`✅ ${sum}`);

//5. 1 থেকে 10 পর্যন্ত সংখ্যাগুলোর গুণফল (factorial) বের করো।
console.log(`🧩 ১ থেকে ১০ পর্যন্ত সংখ্যাগুলোর গুণফল (factorial) বের করা হলো:`);
let factorial = 1 ;
for(let i = 1 ; i <= 10 ;i++){
    factorial *= i;
}console.log(`✅ ${factorial}`);

//6. একটা অ্যারে: ['HTML', 'CSS', 'JavaScript', 'React']
// লুপ দিয়ে প্রতিটা আইটেম প্রিন্ট করো।
console.log(`🧩 একটি অ্যারে থেকে সব আইটেম প্রিন্ট করা হলো:`);
const laka = ['HTML', 'CSS', 'JavaScript', 'React'];
for(const la of laka){
    console.log(`✅ ${la}`);
}

//7. 1 থেকে 50 পর্যন্ত সংখ্যার মধ্যে যেগুলো 3 দিয়ে বিভাজ্য সেগুলো প্রিন্ট করো।
console.log(`🧩 ১ থেকে ৫০ পর্যন্ত সংখ্যার মধ্যে যেগুলো ৩ দিয়ে বিভাজ্য সেগুলো প্রিন্ট করা হলো:`);
for(let i = 1 ; i <= 50 ; i++){
    if( i % 3 === 0){
        console.log(`✅ ${i}`);
    }
}

// 8. একটা অ্যারে: [12, 45, 23, 67, 34, 89, 21]
// লুপ দিয়ে সবগুলোর যোগফল বের করো।
console.log(`🧩 একটি অ্যারে থেকে সব সংখ্যার যোগফল বের করা হলো:`);
const num = [12, 45, 23, 67, 34, 89, 21];
let sum1 = 0 ;
for(const number of num){
    sum1 += number ; 
}
console.log(`✅ ${sum1}`);

// 9. 1 থেকে 100 পর্যন্ত সংখ্যা প্রিন্ট করবে, কিন্তু যদি কোনো সংখ্যা 3 দিয়ে বিভাজ্য হয় তাহলে "Fizz" আর 5 দিয়ে বিভাজ্য হলে "Buzz", আর 3 এবং 5 দুটো দিয়েই বিভাজ্য হলে "FizzBuzz" প্রিন্ট করবে।
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করা হলো, তবে ৩ দিয়ে বিভাজ্য হলে "Fizz", ৫ দিয়ে বিভাজ্য হলে "Buzz", আর ৩ এবং ৫ দুইটাতেই বিভাজ্য হলে "FizzBuzz" প্রিন্ট করা হলো:`);
for(let i  = 1 ; i <= 100 ; i++){
    if(i % 3 === 0 && i % 5 === 0){
        console.log(`✅ FizzBuzz`);
    }else if(i % 3 === 0 ){
        console.log(`✅ Fizz`);
    }else if(i % 5 === 0){
        console.log(`✅ Buzz`);
    }else{
        console.log(`✅ ${i}`);
    }
}

// 10. একটা স্ট্রিং: "Bangladesh" → লুপ দিয়ে প্রতিটা অক্ষর আলাদা করে প্রিন্ট করো।
console.log(`🧩 "Bangladesh" শব্দের প্রতিটি অক্ষর আলাদা করে প্রিন্ট করা হলো:`);
const bd = "Bangladesh";
for(const num of bd){
    console.log(`✅ ${num}`);
}

// 11. ১ থেকে ৫০ পর্যন্ত সব জোড় সংখ্যা প্রিন্ট করো ?
console.log("🧩 ১ থেকে ৫০ পর্যন্ত সব জোড় সংখ্যা প্রিন্ট করা হলো:");
for(let i = 1 ; i <= 50 ; i++ ){
    if(i % 2 === 0 ){
    console.log(` ✅ ${i}`);
    }    
}

// 12. ১ থেকে ১০০ পর্যন্ত সব বিজোড় সংখ্যা যোগফল বের করো ?
let sum0 = 0 ;
for(let num = 1 ; num <= 100 ; num++){
    if( num % 2 === 1){
        sum0+=num ;

    }
}  console.log(`🧮 ১ থেকে ১০০ পর্যন্ত সব বিজোড় সংখ্যার যোগফল হলো: ${sum0}`);

// 13. ১ থেকে ২০ পর্যন্ত সংখ্যাগুলোর গুণফল বের করো ?
let sum01 = 1;
for(let i = 1; i <= 20 ; i++){
    sum01*= i ;
}console.log(`✴️ ১ থেকে ২০ পর্যন্ত সংখ্যাগুলোর গুণফল (Factorial) হলো: ${sum01}`);

// 14. ১ থেকে ৩০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ১৫ এর পরের সব বাদ দাও  ?
console.log('🧩 ১ থেকে ৩০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ১৫ এর পরের সব বাদ দাওয়া হলো:');
for(let i = 1 ; i <= 30 ; i++){
    if( i > 15){
        break;
    }
    console.log( ` ✅  ${i} ` );
}

// 15. ১ থেকে ৩০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ৫ দিয়ে বিভাজ্য সংখ্যা বাদ দাও ?
console.log('🧩 ১ থেকে ৩০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ৫ দিয়ে বিভাজ্য সংখ্যা বাদ দাও হলো:');
for(let i = 1 ; i <= 30 ; i++){
    if( i % 5 === 0 ){
        continue;
    }
    console.log( ` ✅ ${i}`);
}

// 16. ১০ থেকে ১ পর্যন্ত উল্টোভাবে সংখ্যা প্রিন্ট করো ?
 console.log(`🧩 ১০ থেকে ১ পর্যন্ত উল্টোভাবে সংখ্যা প্রিন্ট করো হলো:`);
 for( let i = 10 ; i >= 1 ; i--){
    console.log(` ✅ ${i}`);
 }

// 17.  একটি array থেকে সব নাম প্রিন্ট করো ?
console.log(`🧩 একটি array থেকে সব নাম প্রিন্ট করো হলো:`);
const names = ['Bayezid', 'Hossain' , 'Mridul' , 'Abdul' , 'Motin'];
for(const text of names){
    console.log(` ✅ ${text}`);
}

// 18. ১ থেকে ৫০ পর্যন্ত এমন সংখ্যা বের করো যা ৩ ও ৫ দুইটাতেই বিভাজ্য।
console.log(`🧩 ১ থেকে ৫০ পর্যন্ত এমন সংখ্যা বের করো হলো যা ৩ ও ৫ দুইটাতেই বিভাজ্য:`);
for(let i =1 ; i <= 50 ; i++){
    if(i % 3 === 0 && i % 5 === 0){
        console.log(` ✅ ${i}`);
    }
}

// 19.  Programming Hero” ১৫ বার প্রিন্ট করো ?
console.log(`🧩 Programming Hero” ১৫ বার প্রিন্ট করো হলো:`);
const lifeChange = 'Programming Hero';
for( let i = 1 ; i <= 15 ; i++ ){
    console.log(` ✅ ${lifeChange}`);
}

// 20. ১ থেকে ১০ পর্যন্ত সংখ্যার বর্গ বের করো ?
console.log(`🧩 ১ থেকে ১০ পর্যন্ত সংখ্যার বর্গ বের করো হলো:`);
for(let i = 1 ; i <= 10 ; i++ ){
   let sum = i * i ;
    console.log(` ✅ ${i} এর বর্গ হলো: ${sum}`);
}


// 21. ৫০ থেকে ১০০ পর্যন্ত সব জোড় সংখ্যার যোগফল বের করো ?
let evenSum = 0 ;
for(let i = 50 ; i <=100 ; i++){
    if(i % 2 === 0){
        evenSum += i ;
    }
}
console.log(`🧮 ৫০ থেকে ১০০ পর্যন্ত সব জোড় সংখ্যার যোগফল হলো: ${evenSum}`);

//  22. ১ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ৪ এবং ৬ দুইটাতেই বিভাজ্য হলে “FizzBuzz” লেখো ?
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করো, তবে ৪ এবং ৬ দুইটাতেই বিভাজ্য হলে “FizzBuzz” লেখো হলো:`);
for(let i = 1 ; i <= 100 ; i++){
    if(i % 4 === 0 && i % 6 === 0){
        console.log(` ✅ FizzBuzz`);
    }else{
        console.log(` ✅ ${i}`);
    }
}

// 23. একটি array থেকে কেবল বিজোড় সংখ্যা প্রিন্ট করো ?
console.log(`🧩 একটি array থেকে কেবল বিজোড় সংখ্যা প্রিন্ট করো হলো:`);
const numberArray = [12, 45, 67, 89, 24, 36, 55, 78, 91, 100];
for(const number of numberArray){
    if(number % 2 === 1){
        console.log(` ✅ ${number}`);
    }
}

// 24. ১ থেকে ৩০ পর্যন্ত এমন সংখ্যা প্রিন্ট করো যেগুলোর যোগফল ১০০-এর বেশি হলে লুপ বন্ধ করো ?
console.log("🧩 ১ থেকে ৩০ পর্যন্ত এমন সংখ্যা প্রিন্ট করা হলো, যেগুলোর যোগফল ১০০-এর বেশি হলে লুপ বন্ধ হয়ে যায়:");

let totalSum = 0;

for (let i = 1; i <= 30; i++) {
  totalSum += i;
  if (totalSum > 100) {
    break;
  }
  console.log(` ✅ সংখ্যা: ${i}, মোট যোগফল: ${totalSum}`);
}

console.log(`🔚 লুপ বন্ধ হয়েছে, কারণ যোগফল ${totalSum} > 100`);

// 25. Bangladesh” শব্দের প্রতিটি অক্ষর আলাদা করে প্রিন্ট করো ?
console.log(`🧩 "Bangladesh” শব্দের প্রতিটি অক্ষর আলাদা করে প্রিন্ট করো হলো:`);
const word = 'Bangladesh';
for(const char of word){
    console.log(` ✅ ${char}`);
}

// 26.  ১ থেকে ৫০ পর্যন্ত ৭ দিয়ে বিভাজ্য সংখ্যাগুলোর গড় বের করো ?
console.log(`🧩 ১ থেকে ৫০ পর্যন্ত ৭ দিয়ে বিভাজ্য সংখ্যাগুলোর গড় বের করা হলো:`);
let sum7 = 0;
let count = 0;
for(let i = 1 ; i <= 50 ; i++){
    if(i % 7 === 0){
        sum7 +=i ;
        count++;
    }
}
let average = sum7 / count ;
console.log(` ✅ ৭ দিয়ে বিভাজ্য সংখ্যাগুলোর যোগফল: ${sum7}`);
console.log(` ✅ মোট সংখ্যা: ${count}`);
console.log(` 🎯 গড়: ${average}`);


// 27. একটি array তে থাকা সংখ্যাগুলোর মোট যোগফল বের করো ? 
const numberArray1= [10, 20, 30, 40, 50];
let sum2 = 0;
for(const num of numberArray1){
    sum2 += num ;
}console.log(`✅ একটি array তে থাকা সংখ্যাগুলোর মোট যোগফল বের করা হলো ${sum2}`);

// 28. ১ থেকে ৩০ পর্যন্ত এমন সংখ্যা প্রিন্ট করো যা ৩ দিয়ে ভাগ করলে ভাগশেষ ২ থাকে ?
console.log(`🧩 ১ থেকে ৩০ পর্যন্ত এমন সংখ্যা প্রিন্ট করা হলো যা ৩ দিয়ে ভাগ করলে ভাগশেষ ২ থাকে:`);
for(let i = 1; i <= 30 ; i++){
    if(i % 3 === 2){
        console.log(` ✅ ${i}`);
    }
}
// 29. ১ থেকে ১০ পর্যন্ত সংখ্যার যোগফল while লুপ দিয়ে বের করো ?
let sum3 = 0 ;
let i = 1 ;
while(i <= 10){
    sum3 += i;
    i++;
}console.log(` ✅ ১ থেকে ১০ পর্যন্ত সংখ্যার যোগফল while লুপ দিয়ে যোগফল বের করা হলো: ${sum3}`);

//  30. ১ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করো, কিন্তু প্রতি ১০ নম্বরে “Checkpoint” লেখো ?
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করা হলো, কিন্তু প্রতি ১০ নম্বরে “Checkpoint” লেখা হলো:`);
for(let i = 1 ; i <= 100 ; i++){
     console.log(` ✅ ${i}`);
    if(i % 10 === 0){
       
        console.log( ` ✅ Checkpoint`);
    }
}







// 31. ১ থেকে ৫০ পর্যন্ত সংখ্যার মধ্যে ৯ দিয়ে বিভাজ্য কয়টি সংখ্যা আছে তা গুনে বের করো ?

let count1 = 0 ;
for(let i = 1; i <= 50 ; i++){
    if(i % 9 === 0){
        count1++;
    
        
    }
}    console.log( `✅ ১ থেকে ৫০ পর্যন্ত সংখ্যার মধ্যে ৯ দিয়ে বিভাজ্য কয়টি সংখ্যা আছে তা গুনে বের করা হলো: ${count1}`);

// 32. ৫ থেকে ২৫ পর্যন্ত সংখ্যার মধ্যে প্রতি ধাপে ৩ করে বাড়াও এবং প্রিন্ট করো ?
console.log(`🧩 ৫ থেকে ২৫ পর্যন্ত সংখ্যার মধ্যে প্রতি ধাপে ৩ করে বাড়ানো হলো:`);
for(let i = 5 ; i <= 25 ; i += 3){
    console.log(` ✅ ${i}`);
}

//  33. একটি string উল্টোভাবে (reverse) প্রিন্ট করো ?
console.log(`🧩 একটি string উল্টোভাবে (reverse) প্রিন্ট করো হলো:`);
const name = "dizeyaB";
let reversedName = '';
for(let i = name.length - 1 ; i >= 0 ; i--){
    reversedName += name[i];
}
console.log(` ✅ উল্টোভাবে (reverse) প্রিন্ট করা হলো: ${reversedName}`);

// 34. ১ থেকে ১০০ পর্যন্ত এমন সংখ্যা বের করো যেগুলো ৩ বা ৭ দ্বারা বিভাজ্য, কিন্তু দুইটাতেই না ?
console.log(`🧩 ১ থেকে ১০০ পর্যন্ত এমন সংখ্যা বের করা হলো যেগুলো ৩ বা ৭ দ্বারা বিভাজ্য, কিন্তু দুইটাতেই না:`);
for(let i = 1 ; i <= 100 ; i++ ){
    if( (i % 3 === 0 || i % 7 === 0) && !( i % 3 === 0 && i % 7 === 0)){
        console.log(` ✅ ${i}`);
    }
}


